app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2021-03-03 16:11:55.492176"], ["updated_at", "2021-03-03 16:11:55.492176"], ["title", "buy"], ["deadline", "2021-03-18 00:00:00"], ["category_id", 1]]
---
document.querySelector("#content-"+ "<%= @task.category_id %>").children[0].insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");