app/controllers/email_controller.rb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @email = Email.create(object:Faker::Book.title, body: Faker::ChuckNorris.fact)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def show
    @email = Email.find_by(id: params[:id])

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @email = Email.find_by(id: params[:id])