app/views/email/create.js.erb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
document.getElementById("mail").insertAdjacentHTML("afterbegin", "<%= j render 'email', email: @email %>");